<?php

return [
	////////////////////////////////////////////////////////////////////////////////////////////
	// Текстовые страницы
	////////////////////////////////////////////////////////////////////////////////////////////	
	'TextPage' => [
		'adaptive_image' => [
			'label' => 'Изображения для адаптивности',
			'i18n' => false,
			'sizes' => [
				'480x280' => [
					'width' => 480,
					'height' => 280,
					'minWidth' => 0,
				],
				'768x480' => [
					'width' => 768,
					'height' => 480,
					'minWidth' => 481,
				],
				'1024x640' => [
					'width' => 1024,
					'height' => 640,
					'minWidth' => 769,
				],
				'1280x800' => [
					'width' => 1280,
					'height' => 800,
					'minWidth' => 1025,
				],
				'1440x943' => [
					'width' => 1440,
					'height' => 943,
					'minWidth' => 1281,
				],
			],
		],
	],
	////////////////////////////////////////////////////////////////////////////////////////////
	// Контентные блоки
	////////////////////////////////////////////////////////////////////////////////////////////	
	'ContentBlock' => [
		'adaptive_image' => [
			'label' => 'Изображения для адаптивности',
			'i18n' => false,
			'sizes' => [
				'480x280' => [
					'width' => 480,
					'height' => 280,
					'minWidth' => 0,
				],
				'768x480' => [
					'width' => 768,
					'height' => 480,
					'minWidth' => 481,
				],
				'1024x640' => [
					'width' => 1024,
					'height' => 640,
					'minWidth' => 769,
				],
				'1280x800' => [
					'width' => 1280,
					'height' => 800,
					'minWidth' => 1025,
				],
				'1440x943' => [
					'width' => 1440,
					'height' => 943,
					'minWidth' => 1281,
				],
			],
		],
	],
	////////////////////////////////////////////////////////////////////////////////////////////
	// Слайди
	////////////////////////////////////////////////////////////////////////////////////////////	
	'Slide' => [
		'image_json' => [
			'label' => 'Изображения для адаптивности',
			'i18n' => false,
			'sizes' => [
				'480x280' => [
					'width' => 480,
					'height' => 280,
					'minWidth' => 0,
				],
				'768x480' => [
					'width' => 768,
					'height' => 480,
					'minWidth' => 481,
				],
				'1024x640' => [
					'width' => 1024,
					'height' => 640,
					'minWidth' => 769,
				],
				'1280x800' => [
					'width' => 1280,
					'height' => 800,
					'minWidth' => 1025,
				],
				'1440x943' => [
					'width' => 1440,
					'height' => 943,
					'minWidth' => 1281,
				],
			],
		],
	],
];